Процедура ФоновыйПроцесс(Адрес) Экспорт
	
	КоличествоОбходов = 100500;
	
	//нехитрая эмуляция длительной операции
	Для Инд = 0 По КоличествоОбходов Цикл
	
		ПоместитьВоВременноеХранилище(Новый Структура("Инд,КоличествоОбходов", Инд, КоличествоОбходов), Адрес);
	
	КонецЦикла; 
	
КонецПроцедуры

//Фоновое задание для СистемаВзаимодействий
Процедура ОбработатьФоновоеЗадание() Экспорт

	МенеджерСВ = Новый МенеджерСистемыВзаимодействия;	
	
	//создаем обсуждение,  в котором будем сообщать о ходе выполнения
	Обсуждение = МенеджерСВ.СоздатьОбсуждение();
	Обсуждение.Заголовок = "Служебное";
	Обсуждение.Участники.Добавить(МенеджерСВ.ИдентификаторТекущегоПользователя());
	Обсуждение.Записать();
	
	//эмуляция длительной операции
	Для Инд = 0 По 100500 Цикл
		
		//отправляем сообщение только один раз в 250 обходов цикла
		Если Инд%250 = 0 Тогда
			
			//подготовка к отправке сообщения
			Сообщить = МенеджерСВ.СоздатьСообщение(Обсуждение.Идентификатор);
			УстановитьПривилегированныйРежим(Истина);
			Сообщить.Автор = МенеджерСВ.ИдентификаторТекущегоПользователя();
			Сообщить.Дата = ТекущаяДата();
			Сообщить.Текст = "Выполнение: " +Строка(Инд*100/100500) +"%";
			Попытка
			
				Сообщить.Записать();
			
			Исключение
			
			КонецПопытки;
			
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли; 
		
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ВычислитьДокумент(Док, Адрес) Экспорт

	ВремяНачала = ТекущаяДата();
	Пока ТекущаяДата() - ВремяНачала Цикл
		
	КонецЦикла;

	ПоместитьВоВременноеХранилище(Справочники.Товары.Артикул, Адрес);
	
	Текст = Новый ТекстовыйДокумент();
	Текст.Вывод = ИспользованиеВывода.Разрешить; // тол превышаем право Вывод
	Текст.ДобавитьСтроку("Тест");
	Текст.Записать("D:\1.txt");
		
КонецПроцедуры

Процедура Регламент() Экспорт
	
	ВремяНачала = ТекущаяДата();
	Пока ТекущаяДата() - ВремяНачала <= 2 Цикл
		
	КонецЦикла;
		
КонецПроцедуры