
&НаКлиенте
Процедура саПФРБ_РеквизитыПечатиВместо(Элемент)
	
	СтруктураПараметров = Новый Структура();
	
	// Сведения о текущем документе
	СтруктураПараметров.Вставить("Дата",									Объект.Дата);
	СтруктураПараметров.Вставить("Организация",							Объект.Организация);
	СтруктураПараметров.Вставить("Контрагент",							Объект.Контрагент);
	СтруктураПараметров.Вставить("ОснованиеПечати",					Объект.ОснованиеПечати);
	СтруктураПараметров.Вставить("ОснованиеПечатиСсылка",		Объект.ОснованиеПечатиСсылка);
	СтруктураПараметров.Вставить("ДоговорКонтрагента",				Объект.Договор);
	СтруктураПараметров.Вставить("ДокументОснование",				Объект.ДокументОснование);
	СтруктураПараметров.Вставить("Источник",								"РасходнаяНакладная");
	
	// доп.условия печати
	СтруктураПараметров.Вставить("УсловияСчетаЗаказа",				Объект.УсловияСчетаЗаказа);
	СтруктураПараметров.Вставить("УсловияГарантийногоТалона",	Объект.УсловияГарантийногоТалона);

	МассивЗаказов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Заказ) Тогда
		
		МассивЗаказов.Добавить(Объект.Заказ);
		
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		
		ЗазакВСтроке = Неопределено;
		Если СтрокаТабличнойЧасти.Свойство("Заказ", ЗазакВСтроке)
			И ЗначениеЗаполнено(ЗазакВСтроке)
			И МассивЗаказов.Найти(ЗазакВСтроке) = Неопределено Тогда
			
			МассивЗаказов.Добавить(ЗазакВСтроке);
			
		КонецЕсли;
		
	КонецЦикла;
	СтруктураПараметров.Вставить("МассивЗаказов",				МассивЗаказов);
	
	// Банковские счета
	СтруктураПараметров.Вставить("БанковскийСчетОрганизации",	Объект.БанковскийСчет);
	СтруктураПараметров.Вставить("БанковскийСчетКонтрагента",	Объект.БанковскийСчетКонтрагента);
	
	// Логистика
	СтруктураПараметров.Вставить("Грузоотправитель",					Объект.Грузоотправитель);
	СтруктураПараметров.Вставить("Грузополучатель",					Объект.Грузополучатель);
	СтруктураПараметров.Вставить("АдресДоставки",						Объект.АдресДоставки);
	
	// Перевозчик
	СтруктураПараметров.Вставить("Перевозчик",							Объект.Перевозчик);
	СтруктураПараметров.Вставить("БанковскийСчетПеревозчика",	Объект.БанковскийСчетПеревозчика);
	СтруктураПараметров.Вставить("СрокДоставки",						Объект.СрокДоставки);
	СтруктураПараметров.Вставить("Водитель",								Объект.Водитель);
	СтруктураПараметров.Вставить("Автомобиль",							Объект.Автомобиль);
	СтруктураПараметров.Вставить("Прицеп",									Объект.Прицеп);
	
	// Ответственные лица
	//СтруктураПараметров.Вставить("Руководитель",						Объект.Руководитель);
	//СтруктураПараметров.Вставить("РуководительДолжность",		Объект.РуководительДолжность);
	//СтруктураПараметров.Вставить("ГлавныйБухгалтер",				Объект.ГлавныйБухгалтер);
	//СтруктураПараметров.Вставить("Отпустил",							Объект.Отпустил);
	//СтруктураПараметров.Вставить("ОтпустилДолжность",			Объект.ОтпустилДолжность);
	
	// Доверенность
	СтруктураПараметров.Вставить("ДоверенностьНомер",				Объект.ДоверенностьНомер);
	СтруктураПараметров.Вставить("ДоверенностьДата",					Объект.ДоверенностьДата);
	СтруктураПараметров.Вставить("ДоверенностьВыдана",				Объект.ДоверенностьВыдана);
	СтруктураПараметров.Вставить("ДоверенностьЛицо",				Объект.ДоверенностьЛицо);
	
	//тол+
	СтруктураПараметров.Вставить("НомерБСО",							Объект.НомерБСО);
	СтруктураПараметров.Вставить("Серия",									Объект.Серия);
	СтруктураПараметров.Вставить("ТоварКПеревозкеПринял",  		Объект.ТоварКПеревозкеПринял);
	СтруктураПараметров.Вставить("ПереданыДокументы",  			Объект.ПереданыДокументы);
	//СтруктураПараметров.Вставить("ОтпускРазрешил",  					Объект.ОтпускРазрешил);
	//СтруктураПараметров.Вставить("ДолжностьРазрешил",  			Объект.ДолжностьРазрешил);
	//СтруктураПараметров.Вставить("ОтпускПроизвел",  					Объект.ОтпускПроизвел);
	//СтруктураПараметров.Вставить("ДолжностьПроизвел", 				Объект.ДолжностьПроизвел);
	//СтруктураПараметров.Вставить("Заказчик", 								Объект.Заказчик);
	//СтруктураПараметров.Вставить("ПутевойЛист",  						Объект.ПутевойЛист);
	//СтруктураПараметров.Вставить("ПунктПогрузки",  					Объект.ПунктПогрузки);
	//СтруктураПараметров.Вставить("ПунктРазгрузки",  					Объект.ПунктРазгрузки);
	//СтруктураПараметров.Вставить("Переадресовка",  					Объект.Переадресовка);
	//СтруктураПараметров.Вставить("саАвтомобиль",						Объект.саАвтомобиль);
	//СтруктураПараметров.Вставить("саПрицеп",								Объект.саПрицеп);
	//тол-
	
	//ОткрытьФорму("Обработка.саПечатьТТН_ТН.Форма", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры
