
Функция ОсновнойGET(Запрос)
	
	// XXX поставил на работе
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/JSON; charset=utf-8"); //что бы выходила кирилица
	Если НРЕГ(Запрос.ПараметрыЗапроса.Получить("action")) = "getusers" Тогда
		Ответ.УстановитьТелоИзСтроки(ВернутьСписокПользователей());
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ВернутьСписокПользователей()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ОтветМассив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ОтветМассив.Добавить(Новый Структура("name,id", Выборка.Ссылка.Наименование, ""+Выборка.Ссылка.УникальныйИдентификатор()));
	КонецЦикла;
	
	Ответ = Новый ЗаписьJSON;
	Ответ.УстановитьСтроку();
	ЗаписатьJSON(Ответ,ОтветМассив);
	
	Возврат Ответ.Закрыть();	
	
КонецФункции