
Функция MobClientHTTPPingMe(Запрос)
	перВхИмя = Запрос.ПараметрыURL["ВхДанные"];
	Ответочка = ?(перВхИмя = "ПроверкаПодключения", "Все ОК!", "Все ОК! Вы написали " +перВхИмя);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(Ответочка, КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Возврат Ответ;
КонецФункции

Функция MobClientHTTPPOST_Servis(Запрос)
	перИмяМетода = Запрос.ПараметрыURL["ВхДанные"];
	ЗапросОтКлиентаJSON = Запрос.ПолучитьТелоКакСтроку();
	СтруктураОтвет = МС_МодульHTTPMob.ОбработкаВходящихДанныхHTTP_Сервиса(ЗапросОтКлиентаJSON,перИмяМетода);
	Ответ = Новый HTTPСервисОтвет(СтруктураОтвет.КодОтвета);
	Если СтруктураОтвет.Отработало Тогда
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ДанныеОтвет, КодировкаТекста.UTF8);
	Иначе	
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ТекстОшибки, КодировкаТекста.UTF8);
	КонецЕсли; 
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Возврат Ответ;
КонецФункции
