
&НаКлиенте
Процедура КомандаВыполнитьНажатие(Команда)
	
	//стратуем выполнение длительной операции на сервере в фоновом задании
	КомандаВыполнитьНажатиеНаСервере();
	
	//подключаем обработчик ожидания для мониторинга выполнения процесса
	ПодключитьОбработчикОжидания("ОбработчикОжидания",2,Истина);
	
КонецПроцедуры

&НаСервере
Процедура КомандаВыполнитьНажатиеНаСервере()
	
	//помещаем в хранилище формы, существует в течении жизни формы
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("Инд,КоличествоОбходов",0,1), ЭтаФорма.УникальныйИдентификатор);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(АдресХранилища);
	ФЗ = ФоновыеЗадания.Выполнить("ОбщийМодуль1.ФоновыйПроцесс",  МассивПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжидания() Экспорт

	ДанныеОВыполнении = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(ДанныеОВыполнении) = Тип("Структура") Тогда
		Индикатор = ДанныеОВыполнении.Инд * 100 / ДанныеОВыполнении.КоличествоОбходов;
		Если ДанныеОВыполнении.Инд <> ДанныеОВыполнении.КоличествоОбходов Тогда
			ПодключитьОбработчикОжидания("ОбработчикОжидания",2,Истина);
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры // ОбработчикОжидания()
