
&НаСервере
Процедура ОтправитьЗапросНаСервере()
	
	// создаем новое HTTP соединение с указанием сервера
	// последний параметр отвечает за использование защищенного соединения
	HTTP = Новый HTTPСоединение("localhost", 80,,,,,,Ложь);
	
	// созданим структуру
	ДанныеОКлиенте = Новый 
		Структура("Код, Наименование, Телефон, ЭлектроннаяПочта,JivoID",
		Объект.Код, Объект.Наименование, Объект.Телефон, Объект.ЭлектроннаяПочта);
		
	//сериализуем в json
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеОКлиенте);
	СтрокаДляТела = ЗаписьJSON.Закрыть();
	
	//получим временный файл для передачи в теле POST-запроса
	ФайлТелаЗапроса = ПолучитьИмяВременногоФайла();
	//запишем в файл содержимое тела запроса (текст)
	ТекстФайла = Новый ТекстовыйДокумент;
	ТекстФайла.УстановитьТекст(СтрокаДляТела);
	ТекстФайла.Записать(ФайлТелаЗапроса, КодировкаТекста.UTF8);
	//получим размер данных для передачи в заголовок
	ФайлНаОтправку = Новый Файл(ФайлТелаЗапроса);
	РазмерФайлаНаОтправку = XMLСтрока(ФайлНаОтправку.Размер());
	
	//заголовок создадим в виде соответствия
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	//передаем в заголовках размер и тип данных на отправку
	ЗаголовокЗапросаHTTP.Вставить("Content-Length", РазмерФайлаНаОтправку);
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	
	//создадим заголовок запроса
	ЗапросHTTP = Новый HTTPЗапрос("Demo/hs/Demo/PostCustomerInfo", ЗаголовокЗапросаHTTP);
	
	//загрузить строку в тело
	ЗапросHTTP.УстановитьИмяФайлаТела(ФайлТелаЗапроса);
	
	//отсылаем POST-запрос на обработку
	//ссылкаНаРесурс - ссылка на веб-сервер (страницу), к которой посылается POST запрос
	ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапрос(Команда)
	ОтправитьЗапросНаСервере();
КонецПроцедуры
